var phoneBook; // Тут ви зберігаєте записи як хочете

/*
   Функція додавання запису в телефонну книгу.
*/
phoneBook.add = function (name, phone, email) {
  // Ваша неймовірна магія тут
};

/*
   Функція пошуку записів в телефонній книзі.
   Пошук ведеться по всім полям.
*/
phoneBook.find = function (query) {
  // Ваша магія тут
};

/*
   Функція видалення запису в телефонній книзі.
*/
phoneBook.remove = function (query) {
  // Ваша магія тут
};

/*
   Функція виведення всіх телефонів.
*/
phoneBook.showTable = function () {
  // Ваша чорна магія тут
};